# 状态码
error_code = {
    # 200系列的状态码，表示正常类的请求
    "200": "OK",

    # 400系列的状态码，代表请求类的提示
    "410": "【缺少参数】",
    "420": "【参数错误】",
    "430": "【参数过期】",
    "440": "【参数对应的数据不存在】",
    "450": "【登录提示】",

    # 500系列的状态码，代表服务器内部的提示
    "510": "【sql提示】",
    "520": "【redis提示】",
    "530": "【数据类型转换提示】",
    "540": "【超时提示】",
    "550": "【超出服务提示】",

    # 600系列的状态码，代表请求第三方的提示
    "610": "【微信登录提示】",
    "620": "【微信支付提示】",
    "621": "【微信支付提示】交易不存在！",
    "622": "【微信支付提示】交易创建成功，等待用户支付！",
    "623": "【微信支付提示】交易超时，订单已关闭，请重新下单！",
    "630": "【支付宝支付提示】",
    "631": "【支付宝支付提示】交易不存在！",
    "632": "【支付宝支付提示】交易创建成功，等待用户支付！",
    "633": "【支付宝支付提示】交易超时，订单已关闭，请重新下单！",
    "640": "【算法服务器提示】",
    "650": "【oss存储提示】",
}
